app/Controllers/AdminController.php

SELECT *
FROM `users`
WHERE `role` IN ('staff')
SELECT *
FROM `phone_numbers`
WHERE `user_id` = '14'
 LIMIT 1
SELECT *
FROM `addresses`
WHERE `user_id` = '14'
 LIMIT 1
---
    public function manageStaff()
    {
        $userModel = new \App\Models\UserModel();
        $phoneModel = new \App\Models\PhoneNumberModel();
        $addressModel = new \App\Models\AddressModel();

        $users = $userModel->whereIn('role', ['staff'])->findAll();

        foreach ($users as &$u) {
            $phone = $phoneModel->where('user_id', $u['user_id'])->first();
            $u['phone_number'] = $phone['phone_number'] ?? '';
            $u['status_text'] = (isset($u['status']) && intval($u['status']) === 1) ? 'Active' : 'Inactive';
            $address = $addressModel->where('user_id', $u['user_id'])->first();

SELECT *
FROM `users`
WHERE `role` IN ('staff','Staff')
ORDER BY `user_id` DESC
SELECT *
FROM `phone_numbers`
WHERE `user_id` = '24'
 LIMIT 1
SELECT *
FROM `addresses`
WHERE `user_id` = '24'
 LIMIT 1
---
    public function staffList()
    {
        $userModel = new \App\Models\UserModel();
        $phoneModel = new \App\Models\PhoneNumberModel();
        $addressModel = new \App\Models\AddressModel();

        $users = $userModel->whereIn('role', ['staff', 'Staff'])->orderBy('user_id', 'DESC')->findAll();

        $rows = '';
        $total = 0;
        $active = 0;

        foreach ($users as $s) {
            $total++;
            $isActive = (isset($s['status']) && intval($s['status']) === 1);
            if ($isActive) $active++;

            $phone = $phoneModel->where('user_id', $s['user_id'])->first();
            $phoneNumber = $phone['phone_number'] ?? '';

            $address = $addressModel->where('user_id', $s['user_id'])->first();

SELECT *
FROM `users`
WHERE `role` IN ('customer','Customer')
SELECT *
FROM `phone_numbers`
WHERE `user_id` = '2'
 LIMIT 1
SELECT *
FROM `addresses`
WHERE `user_id` = '2'
 LIMIT 1
---
    public function customerList()
    {
        $userModel = new \App\Models\UserModel();
        $phoneModel = new \App\Models\PhoneNumberModel();
        $addressModel = new \App\Models\AddressModel();

        $customers = $userModel->whereIn('role', ['customer', 'Customer'])->findAll();

        foreach ($customers as &$c) {
            $phone = $phoneModel->where('user_id', $c['user_id'])->first();
            $c['phone'] = $phone['phone_number'] ?? '';
            $address = $addressModel->where('user_id', $c['user_id'])->first();

SELECT `orders`.*, `users`.`name`, `users`.`email`
FROM `orders`
LEFT JOIN `users` ON `users`.`user_id` = `orders`.`user_id`
ORDER BY `orders`.`created_at` DESC
---
    public function manageOrders()
    {
        if (session()->get('role') !== 'admin') {
            return redirect()->to('/login')->with('error', 'Access denied');
        }

        $orderModel = new \App\Models\OrderModel();
        $userModel = new \App\Models\UserModel();

        $orders = $orderModel
            ->select('orders.*, users.name, users.email')
            ->join('users', 'users.user_id = orders.user_id', 'left')
            ->orderBy('orders.created_at', 'DESC')
            ->findAll();

SELECT `orders`.*, `users`.`name`, `users`.`email`
FROM `orders`
LEFT JOIN `users` ON `users`.`user_id` = `orders`.`user_id`
WHERE `orders`.`order_id` = '21'
 LIMIT 1
---
    public function getOrderDetails()
    {
        if (session()->get('role') !== 'admin') {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'Access denied'
            ]);
        }

        $orderId = $this->request->getGet('order_id');
        if (!$orderId) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'Order ID required'
            ]);
        }

        $orderModel = new \App\Models\OrderModel();
        $orderItemModel = new \App\Models\OrderItemModel();
        $addressModel = new \App\Models\AddressModel();

        $order = $orderModel
            ->select('orders.*, users.name, users.email')
            ->join('users', 'users.user_id = orders.user_id', 'left')
            ->where('orders.order_id', $orderId)
            ->first();

SELECT `order_items`.*, `products`.`product_name`, `products`.`image`
FROM `order_items`
LEFT JOIN `products` ON `products`.`product_id` = `order_items`.`product_id`
WHERE `order_items`.`order_id` = '21'
SELECT *
FROM `addresses`
WHERE `user_id` = '2'
 LIMIT 1
---
            ]);
        }

        $items = $orderItemModel
            ->select('order_items.*, products.product_name, products.image')
            ->join('products', 'products.product_id = order_items.product_id', 'left')
            ->where('order_items.order_id', $orderId)
            ->findAll();

        $address = $addressModel->where('user_id', $order['user_id'])->first();

SELECT *
FROM `users`
WHERE `users`.`user_id` = '24'
UPDATE `users` SET `status` = '1', `updated_at` = '2025-11-14 06:23:10'
WHERE `users`.`user_id` IN ('24')
---
    public function toggleStaffStatus()
    {
        if (!$this->request->isAJAX()) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'Invalid request.'
            ]);
        }

        $userId = $this->request->getPost('user_id');
        $status = $this->request->getPost('status');
        if (!$userId || !in_array($status, ['0', '1'], true)) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'Invalid data.'
            ]);
        }

        $userModel = new \App\Models\UserModel();
        $user = $userModel->find($userId);
        if (!$user) {
            return $this->response->setJSON([
                'status' => 'error',
                'message' => 'User not found.'
            ]);
        }

        $userModel->update($userId, ['status' => $status]);