app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `email` = 'staff1@gmail.com'
 LIMIT 1
---
    public function auth()
    {
        helper(['form', 'url']);
        $session    = session();
        $userModel  = new UserModel();
        $email      = $this->request->getVar('email');
        $password   = $this->request->getVar('password');

        $user = $userModel->where('email', $email)->first();