app/Controllers/CustomerController.php

    public function productDetails()
    {
        // Get selected product ID from query string
        $productId = $this->request->getGet('id');

        if (!$productId) {
            return redirect()->to('kathys_crochet_flowers/products')->with('error', 'Invalid product.');
        }

        $productModel = new ProductModel();
        $product = $productModel
            ->select('products.*, categories.category_name')
            ->join('categories', 'categories.category_id = products.category_id', 'left')
            ->where('products.product_id', $productId)
            ->first();

        if (!$product) {
            return redirect()->to('kathys_crochet_flowers/products')->with('error', 'Product not found.');
        }

        // Get related products (same category, exclude current)
        $relatedProducts = [];
        if ($product && !empty($product['category_id'])) {
            $relatedProducts = $productModel
                ->select('products.*, categories.category_name')
                ->join('categories', 'categories.category_id = products.category_id', 'left')
                ->where('products.category_id', $product['category_id'])
                ->where('products.product_id !=', $productId)
                ->limit(4)
                ->findAll();
---
SELECT `products`.*, `categories`.`category_name`
FROM `products`
LEFT JOIN `categories` ON `categories`.`category_id` = `products`.`category_id`
WHERE `products`.`product_id` = '1'
 LIMIT 1
SELECT `products`.*, `categories`.`category_name`
FROM `products`
LEFT JOIN `categories` ON `categories`.`category_id` = `products`.`category_id`
WHERE `products`.`category_id` = '2'
AND `products`.`product_id` != '1'
 LIMIT 4

    public function filterProducts()
    {
        $category_id = $this->request->getPost('category_id');
        $price_range = $this->request->getPost('price_range');

        $productModel = new ProductModel();
        $builder = $productModel
            ->select('products.*, categories.category_name')
            ->join('categories', 'categories.category_id = products.category_id', 'left');

        if ($category_id) {
            $builder->where('products.category_id', $category_id);
        }

        if ($price_range) {
            if ($price_range === 'under500') {
                $builder->where('products.price <', 500);
            } elseif ($price_range === '500-1500') {
                $builder->where('products.price >=', 500)->where('products.price <=', 1500);
            } elseif ($price_range === 'above1500') {
                $builder->where('products.price >', 1500);
            }
        }

        $products = $builder->findAll();
---
SELECT `products`.*, `categories`.`category_name`
FROM `products`
LEFT JOIN `categories` ON `categories`.`category_id` = `products`.`category_id`
WHERE `products`.`category_id` = '2'
AND `products`.`price` > 1500

    public function productList()
    {
        $productModel = new ProductModel();
        // Join products with categories to get category_name for each product
        $products = $productModel
            ->select('products.*, categories.category_name')
            ->join('categories', 'categories.category_id = products.category_id', 'left')
            ->findAll();

        $categoryModel = new CategoryModel();
        $categories = $categoryModel->findAll();
---
SELECT `products`.*, `categories`.`category_name`
FROM `products`
LEFT JOIN `categories` ON `categories`.`category_id` = `products`.`category_id`
SELECT *
FROM `categories`