app/Controllers/StaffController.php

    public function dashboard()
    {
        // Make sure only staff can access
        if (session()->get('role') !== 'staff') {
            return redirect()->to('/login')->with('error', 'Access denied');
        }
        $staff = [
            'name'        => session()->get('name'),
            'email'       => session()->get('email'),
            'phone'       => session()->get('phone'),
            'role'        => session()->get('role'),
            'created_at'  => session()->get('created_at'),
            'profile_image' => session()->get('image'),
        ];

        // Fetch flower stats
        $productModel = model('ProductModel');
        $flowers = $productModel->findAll();
---
SELECT *
FROM `products`

    public function inventory()
    {
        // Make sure only staff can access
        if (session()->get('role') !== 'staff') {
            return redirect()->to('/login')->with('error', 'Access denied');
        }

        $staff = [
            'name'        => session()->get('name'),
            'email'       => session()->get('email'),
            'phone'       => session()->get('phone'),
            'role'        => session()->get('role'),
            'created_at'  => session()->get('created_at'),
            'profile_image' => session()->get('image'),
        ];

        // Fetch flower items from ProductModel
        $productModel = model('ProductModel');
        $flowers = $productModel
            ->select('products.product_id, product_name, category_name as category, products.stock, products.price, products.image')
            ->join('categories', 'categories.category_id = products.category_id', 'left')
            ->findAll();
---
SELECT `products`.`product_id`, `product_name`, `category_name` as `category`, `products`.`stock`, `products`.`price`, `products`.`image`
FROM `products`
LEFT JOIN `categories` ON `categories`.`category_id` = `products`.`category_id`